<template>
  <div class="protcol">
    <h3 style="text-align: center;line-height:1rem">中能源超级会员服务协议</h3>
    <p>如您在本平台注册并成为超级会员，享受本平台所提供的服务，请您认真阅读并理解以下内容。。</p>
    <p>
      本协议是您与本平台运营商“中能源石油天然气有限公司”（以下简称“中能源”、）之间就您使用中能源超级会员服务订立的契约，请您仔细阅读本协议，您点击"同意并继续"按钮后，即视为您已阅读本协议，并接受本协议所有内容，本协议即构成对双方有法律约束力的文件。</p>
    <p><strong>第1条 定义</strong></p>
    <p>1.1平台注册会员：指根据平台要求提供个人信息，在平台完成注册并取得专属用户名的消费者。</p>
    <p>1.2
      平台超级会员：指平台会员通过向平台缴纳年费的形式，获取为期一年（自缴费之日起算）的不同于平台注册会员的身份资格，超级会员在交付年费后，可以获得平台提供的赠品、优惠券及其他低价、折扣商品消费资格，具体以平台当期活动为准。</p>
    <p>1.3平台会员等级：平台会员等级指平台根据付费与否对会员在平台享受的特权作出的差异化划分，主要分为注册会员和超级会员。</p>
    <p>
      1.4平台超级会员体验期：指平台为让利会员，通过不定期活动的方式，对注册会员提供超级会员体验期，注册会员在该免费体验期内可以无需支付费用即享受到超级会员的特权。注册会员免费体验期根据各加油站及平台的活动安排而定，每位注册会员只享有一次免费体验超级会员的机会。具体活动详情咨询客服。</p>
    <p><strong>第2条 平台注册及活动</strong></p>
    <p>2.1本平台的注册用户，需为年满18周岁的完全民事行为能力人，如您不符合此条件，平台有权拒绝您注册。</p>
    <p>2.2 会员在平台接受平台服务，需按照平台要求、规则及法律法规规定进行，如会员在平台从事非法行为或存在滋扰平台其他用户或平台正常经营的行为的，平台有权单方决定拒绝为您提供服务、关闭您账户、清除或编辑内容等相关权利。</p>
    <p>2.3如您通过活动或者其他方式成为平台超级会员，您可享受平台提供的超级会员特权；如您的超级会员资格到期，您可以通过续缴年费进行延期，如您到期未办理延期，则您丧失超级会员资格。</p>
    <p>
      2.4平台超级会员开通后，您在已开通的服务期内主动取消服务或因您个人原因被终止超级会员资格的，您无权要求平台退还您因开通超级会员支付的费用。因平台原因停止提供超级会员服务的，平台将按照剩余日期对应费用按比例退还超级会员开通费。</p>
    <p>2.5平台所提供的超级会员体验期及正式期活动，由平台负责策划和解释。如会员对此有异议，可直接向平台客服进行咨询。</p>
    <p><strong>第3条 活动资格及活动时间</strong></p>
    <p>3.1平台超级会员在满足参与条件的情况下，可申请体验、购买平台超级会员服务；具体参与条件以超级会员权益的体验、购买流程为准；</p>
    <p>3.2中能源超级会员在使用中能源超级会员服务期间，如果违反中能源用户服务协议，包括且不限于到期拒绝续费、账单逾期、账号贩卖等行为时，中能源将有权利终止您的超级会员资格，并拒绝提供超级会员的相关服务；</p>
    <p><strong>第4条 会员权益</strong></p>
    <p>您成为中能源超级会员后，可享受的权益以中能源APP或中能源微信公众号会员权益频道公布的信息为准。
      为更好的向会员提供服务，中能源有权基于自身业务发展需要调整全部或部分会员权益。中能源就前述权益调整将在相应服务页面进行通知或公告，您可以通过中能源APP或中能源微信公众号查询最新的会员权益内容。
    </p>
    <p><strong>第5条 使用注意事项</strong></p>
    <p>
      5.1提交申请开通超级会员申请时，您需提交本人手机号码、证件号码等本站所需的个人资料，并保证提供的注册资料真实、准确、完整、合法有效。注册资料如有变动，应及时更新。如果您提供的注册资料不合法、不真实、不准确、不详尽，您需承担因此引起的相应责任及法律后果，并且平台保留终止您参与该活动的权利。</p>
    <p>
      5.2超级会员资格开通后，您应谨慎合理的保存、使用您的用户名和密码，账户名和密码仅限您本人使用，不得转售、出借等。如用户名和密码保管不善造成的法律后果将由您本人承担。同时中能源在该种情况下有权做出独立判断，有权决定是否采取暂停或关闭您的超级会员资格等措施。</p>
    <p>5.3您同意，平台通过您预留的邮件、短信、电话等形式，向您发送相关活动信息等，为合法的向您推送商品服务信息。如您不接受该些信息，您可联系客服取消。</p>
    <p>
      5.4您同意，您应合理使用您享有的会员权益，除为实现您自身的会员利益外，不得利用您享有的权益非法获利，不得以任何形式售卖、转让、出借您所享有的权益，如您不当使用，平台有权暂停或关闭您的超级会员资格，此外，您需承担因此引起的相应责任及后果。
      5.5超级会员开通服务费说明：平台根据您的授权，执行扣款指令时，扣款金额与扣款发生时平台页面展示的超级会员服务价格一致。
    </p>
    <p><strong>第6条 超级会员退款</strong></p>
    <p>您在开通超级会员资格后，因您个人原因取消该会员资格的，如您未使用任何会员权益，可于会员资格开通之日起算7日内通过电话、在线客服等方式申请退款，超过7天或使用会员权益的，不可申请退款。</p>
    <p><strong>第7条 协议更新及效力</strong></p>
    <p>
      根据国家法律法规变化及平台运营需要，中能源有权以平台内公告或者推送通知的方式进行不定期地制定、修改本协议及/或相关服务规则，暂停、取消和修改本协议条款，修改后的协议一旦在本站公告即生效，并代替原来的协议。您应及时关注平台不时发布的各项服务规则及本协议的变更。</p>
    <p><strong>第8条 法律管辖和适用</strong></p>
    <p>
      本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向平台住所地人民法院即北京市朝阳区人民法院提起诉讼。</p>
    <p><strong>第9条 其他</strong></p>
    <p>9.1中能源网站及、APP及微信公众号所有者是指在政府部门依法许可或备案的中能源APP及微信公众号经营主体。</p>
    <p>9.2如因不可抗力或其它本站无法控制的原因使本站服务无法及时提供或无法按本协议进行的，平台将视情况决定是否关闭本平台服务，如决定关闭平台服务的，将依据未提供服务对应时间按比例计算会员资格服务费，并退还给您。</p>
    <p>9.3您除遵守该协议外，仍应同时遵守《中能源平台服务协议》。</p>
    <p>9.4中能源正式超级会员资格自您购买之日开始计算，到期如无续费，则自动终止。</p>
    <!--<div style="text-align: right; padding-top: 10px;">-->
    <!--<p>合同签署日期：{{year}}年{{month}}月{{date}}日</p>-->
    <!--<p>合同签订地：北京市朝阳区</p>-->
    <!--</div>-->
    <div>
      <x-button :gradients="[ '#FF7500', '#FF9500']" @click.native="goback">我同意</x-button>
    </div>
  </div>
</template>

<script>
  import {XButton} from 'vux'

  export default {
    name: 'membership',
    data() {
      return {
        year: '',
        month: '',
        date: ''
      }
    },
    components: {
      XButton
    },
    methods: {
      goback() {
        this.$router.go(-1)
      }
    },
    mounted() {
      var date = new Date()
      this.year = date.getFullYear()
      this.date = date.getDate()
      this.month = date.getMonth() + 1
    }
  }
</script>

<style>
  .protcol {
    width: 100%;
    height: 100%;
    overflow: scroll;
    -webkit-overflow-scrolling: touch;
    padding: 0.3rem;
    box-sizing: border-box;
  }
  p {
    font-size: 0.25rem;
  }
</style>
