<template>
  <div class="protcol">
    <h3 style="text-align: center;line-height:1rem">中能源会员升级服务协议</h3>
    <p>请认真阅读并理解以下内容。</p>
    <p>本协议是您与“中能源超级会员”的运营商中能源石油天然气有限公司（以下简称“中能源”、“平台”、“中能源平台”）之间就您使用中能源超级会员服务所订立的契约请您仔细阅读本协议，您点击"同意并继续"按钮后，即视为您已阅读本协议，并接受本协议所有内容，本协议即构成对双方有法律约束力的文件。</p>
    <p><strong>第1条 相关定义</strong></p>
    <p>1.1中能源超级会员：中能源超级会员是为中能源客户打造的超级会员服务，通过定期付费的形式（现仅限于年费方式）提供高品质的客户服务，让网购变的更加方便，省钱和放心；</p>
    <p>1.2中能源会员等级：中能源会员的等级将包括且不限于注册会员、超级会员等层级，将会为您提供差异化的品质服务；</p>
    <p>1.3中能源超级会员试用期：中能源可能通过不定期活动的方式，对会员升级服务提供费用减免，减免金额及其服务有效期将以实际活动为准；</p>
    <p><strong>第2条 本站服务条款的确认和接纳</strong></p>
    <p>2.1本站所提供的中能源超级会员试用期及正式期活动的所有权和运作权归中能源所有。</p>
    <p>2.2您点击同意本协议的，即视为您确认自己同意接受中能源超级会员相关服务的条款，且同意按本协议内容履行，如产生相关责任的，同意承担相应法律责任。</p>
    <p>2.3您需为18周岁以上的完全民事行为能力人，如果您在18周岁以下，您只能在父母或监护人的监护参与下方能参与体验该服务。</p>
    <p>2.4中能源保留在中华人民共和国大陆地区之法律允许的范围内单方决定拒绝服务、关闭您账户、清除或编辑内容等相关权利。</p>
    <p>2.5如您通过活动或者其他方式成为中能源超级会员，根据活动规则确定是否获得中能源超级会员正式资格；如您的超级会员资格到期，您可以通过续缴年费进行延期。</p>
    <p>2.6中能源超级会员开通后，您在已开通的服务期内主动取消服务或因您个人原因被终止超级会员资格的，您将不享有退还开通本服务而支付费用的权利。</p>
    <p><strong>第3条 活动资格及活动时间</strong></p>
    <p>3.1中能源超级会员活动仅针对中能源的正式会员。在满足参与条件的情况下，即可申请体验、购买中能源超级会员服务；具体参与条件以超级会员权益的体验、购买流程为准；</p>
    <p>3.2中能源超级会员在使用中能源超级会员服务期间，如果违反中能源用户服务协议，包括且不限于到期拒绝续费、账单逾期、账号贩卖等行为时，中能源将有权利终止您的超级会员资格，并拒绝提供超级会员的相关服务；</p>
    <p><strong>第4条 会员权益</strong></p>
    <p>您成为中能源超级会员后，可享受的权益以中能源APP/微信端会员权益频道公布的信息为准。</p>
    <p>为更好的向会员提供服务，中能源有权基于自身业务发展需要调整全部或部分会员权益。中能源就前述权益调整将在相应服务页面进行通知或公告，您可以通过中能源APP/微信端查询最新的会员权益内容。</p>
    <p><strong>第5条 使用注意事项</strong></p>
    <p>5.1提交申请开通超级会员申请时，您需提交本人手机号码、证件号码等本站所需的个人资料，并保证提供的注册资料真实、准确、完整、合法有效，您注册资料如有变动的，应及时更新注册资料。如果您提供的注册资料不合法、不真实、不准确、不详尽，您需承担因此引起的相应责任及法律后果，并且中能源保留终止您参与该活动的权利。</p>
    <p>5.2超级服务开通后，您应谨慎合理的保存、使用您的用户名和密码，如保管不善造成的法律后果将由您本人承担。同时中能源在该种情况下有权做出独立判断，有权决定是否采取暂停或关闭您的超级会员资格等措施。</p>
    <p>5.3您同意，中能源拥有通过邮件、短信、电话等形式，向您发送相关活动信息等的权利。</p>
    <p>5.4您同意，您应合理使用您享有的会员权益，除为实现您自身的会员利益外，不得利用您享有的权益非法获利，不得以任何形式售卖、转让、出借您所享有的权益，如因您不当使用行为，中能源有权暂停或关闭您的超级会员资格，此外，您需承担因此引起的相应责任及后果。</p>
    <p>5.5自动续费服务及金额说明：中能源根据您的授权，执行扣款指令时，扣款金额以扣款发生时中能源页面展示的超级会员服务价格为准。</p>
    <p><strong>第6条 会员退款注意事项</strong></p>
    <p>退款规则说明：购买中能源超级会员，如您未使用任何会员权益，可于7天内通过电话、在线客服等方式联系客服申请退款，超过7天或使用会员权益后，不可申请退款。</p>
    <p><strong>第7条 协议更新及您关注义务</strong></p>
    <p>7.1根据国家法律法规变化及平台运营需要，中能源有权以平台内公告或者推送通知的方式进行不定期地制定、修改本协议及/或相关服务规则，暂停、取消和修改本协议条款，修改后的协议一旦在本站公告上即生效，并代替原来的协议。您应及时关注不时发布的各项服务规则及本协议的变更。若不同意相关规则及条款修改的，应及时终止与本站的协议。如您继续使用中能源客户端或微信端提供的服务的，即视为同意更新后的协议。</p>
    <p><strong>第8条 法律管辖和适用</strong></p>
    <p>8.1本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向协议签订地人民法院提起诉讼。</p>
    <p><strong>第9条 其他</strong></p>
    <p>9.1中能源网站及APP/微信端所有者是指在政府部门依法许可或备案的中能源APP经营主体。</p>
    <p>9.2如因不可抗力或其它本站无法控制的原因使本站服务无法及时提供或无法按本协议进行的，中能源会合理处理善后事宜。</p>
    <p>9.3您除遵守该协议外，仍应同时遵守《中能源平台服务协议》。</p>
    <p>9.4中能源正式超级会员资格自您购买之曰起开始计算，到期视情况可自动延期，具体以会员权益活动页面的运营规则为准。</p>
    <div style="text-align: right; padding-top: 10px;">
      <p>合同签署日期：{{year}}年{{month}}月{{date}}日</p>
      <p>合同签订地：北京市朝阳区</p>
    </div>
    <div><x-button :gradients="[ '#FF7500', '#FF9500']" @click.native="goback">我同意</x-button></div>
  </div>
</template>

<script>
import { XButton } from 'vux'
export default {
  name: 'membership',
  data () {
    return {
      year: '',
      month: '',
      date: ''
    }
  },
  components: {
    XButton
  },
  methods: {
    goback () {
      this.$router.go(-1)
    }
  },
  mounted () {
    var date = new Date()
    this.year = date.getFullYear()
    this.date = date.getDate()
    this.month = date.getMonth() + 1
  }
}
</script>

<style>
  .protcol {
    width: 100%;
    height: 100%;
    overflow: scroll;
    -webkit-overflow-scrolling: touch;
    padding: 0.3rem;
    box-sizing: border-box;
  }
  p{
    font-size: 0.25rem;
  }
</style>
